package pmelnik.local.leetcode_medium;

/**
 * Краткое описание решения
 * Используем жадный алгоритм:
 * на каждом шаге берем максимально возможное римское число из таблицы соответствий,
 * вычитаем его значение и добавляем символ к результату.
 * ---
 * Анализ сложности
 * Время: O(1) - константное время, так как таблица фиксированного размера (13 элементов)
 * Память: O(1) - константная память
 */
public class IntegerToRomanNum12 {

    public String intToRoman(int num) {


        return "";
    }

}
